# Знакомство с языком программирования С#

**Remember!** Язык программирования - это всего лишь _инструмент_.
## Первые шаги написания программы
1. Получить задачу;
2. Обдумать условие;
3. Уточнить условие;
4. Составить алгоритм;
5. Уточнить алгоритм;
6. Исправить алгоритм;
7. Перепроверить алгоритм;
8. Начать писать код, но это не точно.
### Установка и настройка окружения
Мы будем использовать `VS Code`

Программа представляет из себя:
* `данные`
* которые обрабатываются по определённой `логике`
* и всё это оформлено `интерфейсом`

1. Устанавливаем .Net
2. Устанавливаем расширение C#
3. Создаём папку Lecture_05-08-2022
4. Инициализируем эту папку посредством команды `git init` в терминале
5. В этой папке создаём ещё папку `Example001_HelloConsole`
6. Открываем отдельную консоль для этой папки
7. В этой консоли прописываем команду `dotnet new console`. Эта команда создаёт новый проект
8. Чтобы запустить программу "Hello world" надо набрать в терминале команду `dotnet run`
## Создаём новое приложение
### Алгоритм:
1. Начало
2. Ввести <имя пользователя>
3. Вывести "Привет,"
4. Вывести "Имя пользователя"
5. Конец
### На данном этапе можно добавить наш проект на GitHab. Для этого:
1. Переходим в нужный терминал
2. Набираем команду `git add Example001_HelloConsole` чтобы отслеживать изменения в нашей папке
3. Набираем команду `git commit -a`, затем вводим комментарий

Просмотр превой лекции остановил на 22:13

Продолжаем лекцию. Вводим следующий код:

``` bash
Console.WriteLine("Enter your name"); // Выводит строку с просьбой ввести имя
string username = Console.ReadLine(); // Здесь терминал ожидает ввода строки
Console.WriteLine("Hello, "); // Выводит приветствие
Console.WriteLine(username); // Выводит имя
```
Теперь попробуем следующий код
``` bash
Console.Write("Enter your name");
string username = Console.ReadLine();
Console.Write("Hello, ");
Console.Write(username);
```
Теперь всё закоммитим и отправим в репозиторий

Запомним команды:
``` bash
Write(); // Вывод в одну строку
WriteLine(); В конце перейти на новую строку
ReadLine(); Считать строку из терминала
```
### Теперь напишем более сложную программу
Задача:

Написать программу на языке C#,

для Windows и MacOS,

[в которую пользователь вводит два числа]

[в которой записаны два числа]

[два числа генерируются случайным образом]

и получает сумму

### Типы данных
int - целые числа

double - числа с плавающей точкой

string - строки

bool - ложь/истина

Генератор псевдослучайных чисел:
``` bash
new Random().Next(min, max) // даст случайное целое число от min до max-1 [min, max-1] или [min, max)
```
# Программа особого приветствия
Синтаксис: начало
* Начало
* Ввести имя пользователя
* Если имя пользователя совпадает с "Маша", то приветствуем по-особенному
* Иначе приветствовать по-обычному
* Конец
``` bash
if (условие)
{
    Набор действий 1
}
else
{
    Набор действий 2
}
```
# Программа №7
### Алгоритм:
1. Определить три точки
2. Выбрать две любых
3. Найти середину
4. Поставить точку
5. Выбрать случайную вершину треугольника
6. Соединить её с полученной на 4 шаге точкой
7. Перейти к шагу 3
8. Шаги 3 - 7 повторить 9, 28, 31 раз
### Синтаксис
``` bash
while(условие продолжения)
{
    Набор действий
}

count = 0;

while(count < 100)
{
    Набор действий
    count = count + 1
}
```
# Семинар от 06.08.2022
1. Создаём папку которую мы будем отслеживать (корневую)
2. Создаём вложенные папки
3. Вводим команду `git init` в корневой папке
4. В папке для отдельной задачи открываем консоль и вводим команду `dotnet new console`
5. Переходим в консоль корневой папки и вводим команду `dotnet new gitignore` (появится файл .gitignore)
6. Заходим в папку упражнения и выполняем упражнения
7. Устанавливаем дополнительные плагины в т.ч. Draw.io
8. Создаём файл `Ex01.drawio.png и там рисуем блок-схему задачи
9. Пишем код программы
10. Запускаем программу, тестируем `dotnet run`
11. Фиксируем изменения

*Hint!* форматирование кода доступно в VS Code через следующие ярлыки:

На Windows Shift + Alt + F